In [62]:
import pandas as pd
import numpy as np

In [63]:
x=pd.Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [64]:
x=pd.Series([1,2,3,4],index=['1st','2nd','3rd','4th'])
x

1st    1
2nd    2
3rd    3
4th    4
dtype: int64

In [65]:
x.values

array([1, 2, 3, 4], dtype=int64)

In [66]:
x.index

Index(['1st', '2nd', '3rd', '4th'], dtype='object')

In [67]:
x['3rd']

3

In [68]:
x['3rd']=88

In [69]:
x

1st     1
2nd     2
3rd    88
4th     4
dtype: int64

In [70]:
x.idxmax()

'3rd'

In [71]:
x.idxmin()

'1st'

In [72]:
arr=np.array([2,7,8,10,11,13,18])
y=pd.Series(arr)

In [73]:
y

0     2
1     7
2     8
3    10
4    11
5    13
6    18
dtype: int32

In [74]:
y[y>10]

4    11
5    13
6    18
dtype: int32

In [75]:
y+2

0     4
1     9
2    10
3    12
4    13
5    15
6    20
dtype: int32

In [76]:
y-2

0     0
1     5
2     6
3     8
4     9
5    11
6    16
dtype: int32

In [77]:
y*3

0     6
1    21
2    24
3    30
4    33
5    39
6    54
dtype: int32

In [78]:
y.value_counts()

2     1
7     1
8     1
10    1
11    1
13    1
18    1
Name: count, dtype: int64

In [79]:
a=pd.Series([1,2,3,2,3,3,4,8])
a

0    1
1    2
2    3
3    2
4    3
5    3
6    4
7    8
dtype: int64

In [80]:
a.value_counts()

3    3
2    2
1    1
4    1
8    1
Name: count, dtype: int64

In [81]:
a.unique()

array([1, 2, 3, 4, 8], dtype=int64)

In [82]:
a.nunique()

5

In [83]:
a.mode()

0    3
dtype: int64

In [84]:
a.mean()

3.25

In [85]:
a.std()

2.1213203435596424

In [86]:
data=({"Name":["Deepak","Kirthish","Naruto"],"Age":[20,11,17]})
df=pd.DataFrame(data)
df

       Name  Age
0    Deepak   20
1  Kirthish   11
2    Naruto   17

In [176]:
df=pd.read_csv('data.csv')
df

       Name  Age  salary
0    Deepak   20   25000
1  kirthish   15   20000
2    Naruto   17   15000
3    sasuke   18   17000
4   kakashi   35    3000

In [88]:
df.head(3)

       Name  Age  salary
0    Deepak   20   25000
1  kirthish   15   20000
2    Naruto   17   15000

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [93]:
df.describe()

             Age        salary
count   5.000000      5.000000
mean   21.000000  16000.000000
std     8.031189   8185.352772
min    15.000000   3000.000000
25%    17.000000  15000.000000
50%    18.000000  17000.000000
75%    20.000000  20000.000000
max    35.000000  25000.000000

In [95]:
Games = [
    ['Deepak',20,'cricket'],
    ['Kirthish',17,'Cricket'],
    ['Naruto',18,'Football'],
    ['Roman',38,'wrestling']
    
]
df_2 = pd.DataFrame(Games,columns=['Name','Age','Game'])

In [96]:
df_2

       Name  Age       Game
0    Deepak   20    cricket
1  Kirthish   17    Cricket
2    Naruto   18   Football
3     Roman   38  wrestling

In [97]:
df_2['Name']

0      Deepak
1    Kirthish
2      Naruto
3       Roman
Name: Name, dtype: object

In [101]:
df_2.iloc[0]

Name     Deepak
Age          20
Game    cricket
Name: 0, dtype: object

In [104]:
df_2.loc[0,'Game']

'cricket'

In [106]:
df_2.iloc[2,2]

'Football'

In [107]:
df_2['city']=['Kanyakumari','Kanyakumari','Leafvillage','losangels']

In [108]:
df_2

       Name  Age       Game         city
0    Deepak   20    cricket  Kanyakumari
1  Kirthish   17    Cricket  Kanyakumari
2    Naruto   18   Football  Leafvillage
3     Roman   38  wrestling    losangels

In [111]:
df_2.iloc[2,1]

18

In [ ]:
#delete column city from games
df_2.drop('city',axis=1,inplace=True)

In [114]:
df_2

       Name  Age       Game
0    Deepak   20    cricket
1  Kirthish   17    Cricket
2    Naruto   18   Football
3     Roman   38  wrestling

In [115]:
df_2['score']=[180,170,32,60]
df_2

       Name  Age       Game  score
0    Deepak   20    cricket    180
1  Kirthish   17    Cricket    170
2    Naruto   18   Football     32
3     Roman   38  wrestling     60

In [126]:
#add new value
new_vale={"Name":"sethrollings","Age":37,"Game":"Wrestling","score":170}
df=pd.concat([df_2,pd.DataFrame([new_vale])],ignore_index=True)

In [127]:
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    Cricket    170
2        Naruto   18   Football     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [128]:
#update a particular data
df.at[1,'score']=195

In [129]:
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    Cricket    195
2        Naruto   18   Football     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [153]:
df.at[1,'Game']='cricket'
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18    cricket     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [155]:
df.at[2,'Game']='Boxing'
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18     Boxing     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [151]:
df.loc[df['Name']=='Roman','score']=120
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    Cricket    195
2        Naruto   18   Football     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [154]:
#filter
fil=df[(df['score'] >150) & (df['Game'] == 'cricket')]
fil

       Name  Age     Game  score
0    Deepak   20  cricket    180
1  Kirthish   17  cricket    195

In [161]:
#sort df
df.sort_values('Age',ascending=False)
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18     Boxing     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [189]:
data={"Name":['Naruto','Kakashi','Jiraya','Orachimaru','Madara','itachi'],"Age":[18,28,56,56,65,26]}
df=pd.DataFrame(data)
df

         Name  Age
0      Naruto   18
1     Kakashi   28
2      Jiraya   56
3  Orachimaru   56
4      Madara   65
5      itachi   26

In [190]:
df['Rank']=[3,2,None,4,None,1]
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
2      Jiraya   56   NaN
3  Orachimaru   56   4.0
4      Madara   65   NaN
5      itachi   26   1.0

In [188]:
#df.fillna(1,inplace=True)
#df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
2      Jiraya   56   1.0
3  Orachimaru   56   4.0
4      Madara   65   1.0
5      itachi   26   1.0

In [191]:
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
2      Jiraya   56   NaN
3  Orachimaru   56   4.0
4      Madara   65   NaN
5      itachi   26   1.0

In [193]:
df.dropna(inplace=True)
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
3  Orachimaru   56   4.0
5      itachi   26   1.0